elevator/system/tmp
(0 1 5 4) 
(1 2 6 5) 
(2 3 7 6) 
(4 5 9 8) 
(5 6 10 9) 
(6 7 11 10) 
(8 9 13 12) 
(9 10 14 13) 
(10 11 15 14) 

(16 17 21 20) 
(17 18 22 21) 
(18 19 23 22) 
(20 21 25 24)  
(21 22 26 25) 
(22 23 27 26) 
(24 25 29 28) 
(25 26 30 29)
(26 27 31 30) 